/*
SQLyog Ultimate v13.1.1 (64 bit)
MySQL - 5.7.36 : Database - face_recognition
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`face_recognition` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_bin */;

USE `face_recognition`;

/*Table structure for table `combined_status` */

DROP TABLE IF EXISTS `combined_status`;

CREATE TABLE `combined_status` (
  `id` varchar(500) COLLATE utf8_bin DEFAULT NULL,
  `familya` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `imya` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `otchestvo` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `doljnost` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `date` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `time` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `status` varchar(20) COLLATE utf8_bin DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `combined_status` */

insert  into `combined_status`(`id`,`familya`,`imya`,`otchestvo`,`doljnost`,`date`,`time`,`status`) values 
('1','Махкамов','Диловар','Фарходович','Программист','25.11.2023','19:21','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','25.11.2023','19:28','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','28.11.2023','11:26','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','28.11.2023','11:26','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:38','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:38','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:38','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:38','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:38','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:39','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:39','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:39','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:45','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:46','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:47','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','16:47','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','23:33','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','23:34','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','23:35','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','3.12.2023','23:36','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:21','Вход'),
('0001','Тест','тест','тест','тест','4.12.2023','12:21','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:22','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:22','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:22','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:32','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','12:32','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:34','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:35','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:35','Вход'),
('0001','Тест','тест','тест','тест','4.12.2023','13:35','Вход'),
('0001','Тест','тест','тест','тест','4.12.2023','13:35','Выход'),
('0001','Тест','тест','тест','тест','4.12.2023','13:35','Вход'),
('0001','Тест','тест','тест','тест','4.12.2023','13:35','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:59','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:59','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','13:59','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','15:12','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','4.12.2023','15:12','Выход'),
('0001','Тест','тест','тест','тест','6.12.2023','22:59','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:3','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:3','Выход'),
('8887','Бободжонов','Андрей','Абдумажидович','Студент','6.12.2023','23:22','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:22','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:22','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:23','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:25','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:25','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','6.12.2023','23:25','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','0:26','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','0:26','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','0:27','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','0:27','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','0:27','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','12:40','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','12:40','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','12:40','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:4','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:4','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:5','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:5','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:12','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','7.12.2023','13:12','Выход'),
('','','','','','8.12.2023','0:19','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:19','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:19','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:19','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:19','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:25','Выход'),
('0001','Тест','тест','тест','тест','8.12.2023','0:25','Вход'),
('8887','Бободжонов','Андрей','Абдумажидович','Студент','8.12.2023','0:25','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:26','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:26','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:26','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','8.12.2023','0:26','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:1','Вход'),
('0001','Тест','тест','тест','тест','11.12.2023','15:1','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:1','Выход'),
('','','','','','11.12.2023','15:2','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:2','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:2','Выход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:2','Вход'),
('1','Махкамов','Диловар','Фарходович','Программист','11.12.2023','15:3','Выход');

/*Table structure for table `employees` */

DROP TABLE IF EXISTS `employees`;

CREATE TABLE `employees` (
  `id` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `familya` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `imya` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `otchestvo` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `doljnost` varchar(50) COLLATE utf8_bin DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `employees` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
